# Day 1: Introduction to Data Science, Internal Data Acquisition and Exploratory Data Analysis

Company Name: theDevmasters 
Author: Cloris Li


#### Description: Day 1, Introduction to Data Science, Internal Data Acquisition and Exploratory Data Analysis

## Table of Contents

### Introduction to Data Science
- Relationship and differences between DS, AI, ML, DL
- CRISP-DM
- Business Applications

### Internal Data Acquisition
- Introduction to Pandas
- Importing & Exporting CSV, Excel, SQL, etc

### Exploratory Data Analysis
- Pandas Filter, GroupBy, Aggregations, Pivot table
- Numpy
- Datetime

### I. Introduction to Data Science

### II. Internal Data Acquisition
#### Pandas
- Primary objects in Pandas are DataFrames
- DataFrames are like tables
    - Contain rows and columns of data
    - Columns have names
    - Rows have index values
- Pandas has easy functions for importing and exporting data
    - CSV files
    - Excel spreadsheets
    - SQL queries
    - XML and others
##### 2.1.1 Framework

In [1]:
import pandas as pd

In [2]:
df_empty = pd.DataFrame()
df_empty

Empty DataFrame
Columns: []
Index: []

In [3]:
df = pd.DataFrame({'name':['Bob', 'Jen', 'Tim'],
                  'age':[20, 30, 40],
                  'pet':['cat', 'dog', 'bird']})
df

  name  age   pet
0  Bob   20   cat
1  Jen   30   dog
2  Tim   40  bird

In [4]:
df[['name', 'age']]

  name  age
0  Bob   20
1  Jen   30
2  Tim   40

In [5]:
df.name

0    Bob
1    Jen
2    Tim
Name: name, dtype: object

In [6]:
##### 2.1.2 Indexing
Q: What are the two ways you can grab a column in Pandas?

Object `Pandas` not found.

In [7]:
# 'First name'
# df.ix[0]

In [8]:
df.sort_values('pet', inplace=True)
df

  name  age   pet
2  Tim   40  bird
0  Bob   20   cat
1  Jen   30   dog

In [9]:
df.iloc[0]

name     Tim
age       40
pet     bird
Name: 2, dtype: object

In [10]:
df.iloc[:,2]

2    bird
0     cat
1     dog
Name: pet, dtype: object

In [11]:
df.iloc[-1:]

  name  age  pet
1  Jen   30  dog

Q: What are the main ways we can index a DataFrame?

In [12]:
#### 2.2 Importing & Exporting
##### 2.2.1 CSV

In [14]:
# csv dosya okuma
data = pd.read_csv('test_pandas.csv')
data

   0  1   cat  1.1
0  1  2   dog  2.2
1  2  3  bird  3.3

In [15]:
data.to_csv('test_pandas_no_header.csv', header=False, index=True)
data

   0  1   cat  1.1
0  1  2   dog  2.2
1  2  3  bird  3.3

In [16]:
dat_no_header = pd.read_csv('test_pandas_no_header.csv')
dat_no_header

   0  1  2   dog  2.2
0  1  2  3  bird  3.3

##### 2.2.2 Excel

In [18]:
#!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 250.0/250.0 kB 1.1 MB/s eta 0:00:00 MB/s eta 0:00:01:01
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2
Note: you may need to restart the kernel to use updated packages.

In [19]:
data = pd.read_excel('testpandas.xlsm', 'Sheet1')
data

/home/chary/Projects/machine_learning_class/venv/lib/python3.9/site-packages/openpyxl/worksheet/_reader.py:329: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

   Column A Column B  Column C
0         1      cat       1.1
1         2      dog       2.2
2         3     bird       3.3

In [21]:
writer = pd.ExcelWriter('test_sheets.xlsm')
data.to_excel(writer, 'Original')
data.to_excel(writer, 'Copy')
writer.save()
pd.read_excel('test_sheets.xlsx', 'Original')

/tmp/ipykernel_43375/2531578719.py:4: FutureWarning: save is not part of the public API, usage can give unexpected results and will be removed in a future version
  writer.save()

   Unnamed: 0  0  1     2    3
0           0  0  1   cat  1.1
1           1  1  2   dog  2.2
2           2  2  3  bird  3.3

##### 2.2.3 SQL

In [25]:
import sqlite3
conn = sqlite3.connect('test_pandas.db')

In [26]:
sql_query = "SELECT * FROM test"
data = pd.read_sql(sql_query, conn)
data

   id           city    mascot
0   1  San Francisco     49ers
1   2        Oakland   Raiders
2   3        Seattle  Seahawks
3   4        Chicago     Bears
4   5            NYC      Jets
5   6             LA      Rams
6   7            ANA  Chargers

In [27]:
data.sort_values(by='city')

   id           city    mascot
6   7            ANA  Chargers
3   4        Chicago     Bears
5   6             LA      Rams
4   5            NYC      Jets
1   2        Oakland   Raiders
0   1  San Francisco     49ers
2   3        Seattle  Seahawks

In [28]:
tables = conn.execute("SELECT name FROM sqlite_master WHERE type='table'")

In [29]:
new_data = pd.DataFrame({'id':[6, 7],
                        'city':['LA', 'ANA'],
                        'mascot':['Rams', 'Chargers']})
new_data

   id city    mascot
0   6   LA      Rams
1   7  ANA  Chargers

In [30]:
new_data.to_sql('test', conn, if_exists='append', index=False)

2

In [31]:
conn.close()